kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
    // Connect/Disconnect button with status
    if (!is_connected_) {
        if (ImGui::Button("Connect")) {
            ConnectToDevice();
        }
    } else {
        if (ImGui::Button("Disconnect")) {
            DisconnectFromDevice();
        }
    }
    
    // Show connection status
    if (connection_attempted_) {
        ImGui::SameLine();
        if (is_connected_) {
            ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ Connected");
        } else {
            ImGui::TextColored(ImVec4(1.0f, 0.0f, 0.0f, 1.0f), "✗ Failed");
        }
    }
    
    ImGui::SameLine();
    ImGui::Separator();
    ImGui::SameLine();
    
    // Action buttons
    if (ImGui::Button("Upload")) {
        UploadCode();
    }
    ImGui::SameLine();
    
    if (ImGui::Button("Download")) {
        DownloadFirmware();
    }
    ImGui::SameLine();
    
    if (ImGui::Button("Debug")) {
        DebugCode();
    }
    ImGui::SameLine();
    
    if (ImGui::Button("RE")) {
        ReverseEngineerCode();
        current_center_tab_ = 2; // Switch to RE tab
    }
    
    ImGui::End();
}

void ImGuiWindow::RenderFileExplorer() {
    ImGui::Text("File Explorer");
    ImGui::Separator();
    
    if (ImGui::Button("New File")) {
        // Create new editor tab
        EditorTab new_tab;
        new_tab.filename = "sketch_" + std::to_string(editor_tabs_.size() + 1) + ".ino";
        new_tab.content = SIMPLE_SKETCH_TEMPLATE;
        new_tab.is_modified = false;
        std::snprintf(new_tab.buffer, EDITOR_BUFFER_SIZE, "%s", new_tab.content.c_str());
        editor_tabs_.push_back(new_tab);
        active_editor_tab_ = editor_tabs_.size() - 1;
        RefreshFileList();
    }
    
    ImGui::SameLine();
    if (ImGui::Button("New Folder")) {
        FileNode new_folder;
        new_folder.name = "NewFolder";
        new_folder.path = "/NewFolder";
        new_folder.is_folder = true;
        root_folder_.children.push_back(new_folder);
    }
    
    ImGui::SameLine();
    if (ImGui::Button("Refresh")) {
        RefreshFileList();
    }
    
    ImGui::Separator();
    
    // Render hierarchical file tree
    RenderFileNode(root_folder_, "");
}

void ImGuiWindow::RenderCenterPanel() {
    if (ImGui::BeginTabBar("CenterTabs")) {
        if (ImGui::BeginTabItem("Editor")) {
            current_center_tab_ = 0;
            RenderEditorTab();
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Debugger")) {
            current_center_tab_ = 1;
            RenderDebuggerTab();
            ImGui::EndTabItem();
        }
        
        if (ImGui::BeginTabItem("Reverse Engineering")) {
            current_center_tab_ = 2;
            RenderReverseEngineeringTab();
            ImGui::EndTabItem();
        }
        
        ImGui::EndTabBar();
    }
}

void ImGuiWindow::RenderEditorTab() {
    // Multi-tab editor
    if (editor_tabs_.empty()) {
        ImGui::TextColored(ImVec4(0.7f, 0.7f, 0.7f, 1.0f), "No files open. Create a new file or open an existing one.");
        return;
    }
    
    if (ImGui::BeginTabBar("EditorTabs", ImGuiTabBarFlags_Reorderable | ImGuiTabBarFlags_AutoSelectNewTabs)) {
        for (size_t i = 0; i < editor_tabs_.size(); i++) {
            bool open = true;
            std::string tab_label = editor_tabs_[i].filename;
            if (editor_tabs_[i].is_modified) {
                tab_label += "*";
            }
            
            if (ImGui::BeginTabItem(tab_label.c_str(), &open)) {
                active_editor_tab_ = i;
                
                ImGui::Text("File: %s", editor_tabs_[i].filename.c_str());
                if (editor_tabs_[i].is_modified) {
                    ImGui::SameLine();
                    ImGui::TextColored(ImVec4(1.0f, 0.7f, 0.0f, 1.0f), "(modified)");
                }
                
                ImGui::Separator();
                
                // Text editor
                ImGuiInputTextFlags flags = ImGuiInputTextFlags_AllowTabInput;
                if (ImGui::InputTextMultiline("##editor", editor_tabs_[i].buffer, EDITOR_BUFFER_SIZE,
                                              ImVec2(-1, -1), flags)) {
                    editor_tabs_[i].content = std::string(editor_tabs_[i].buffer);
                    editor_tabs_[i].is_modified = true;
                    line_count_dirty_ = true;
                    if (text_editor_) {
                        text_editor_->SetText(editor_tabs_[i].content);
                    }
                }
                
                ImGui::EndTabItem();
            }
            
            if (!open) {
                CloseTab(i);
            }
        }
        
        ImGui::EndTabBar();
    }
}

void ImGuiWindow::RenderDebuggerTab() {
    ImGui::Text("ESP32 Debugger");
    ImGui::Separator();
    
    // Check connection status
    if (!is_connected_) {
        ImGui::TextColored(ImVec4(1.0f, 0.5f, 0.0f, 1.0f), "⚠ No device connected");
        ImGui::TextWrapped("Please connect to a device using the toolbar before debugging.");
        ImGui::Spacing();
        if (ImGui::Button("Go to Toolbar")) {
            AddConsoleMessage("Use the Connect button in the toolbar to connect to your ESP32 device");
        }
        return;
    }
    
    ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ Device connected: %s", selected_port_.c_str());
    ImGui::Spacing();
    
    if (ImGui::Button("Start Debugging")) {
        DebugCode();
    }
    
    ImGui::SameLine();
    if (ImGui::Button("Stop")) {
        AddConsoleMessage("Debugging stopped");
    }
    
    ImGui::Separator();
    ImGui::Text("Breakpoints:");
    ImGui::BulletText("No breakpoints set");
    
    ImGui::Separator();
    ImGui::Text("Variables:");
    ImGui::BulletText("Debug session not active");
}

void ImGuiWindow::RenderReverseEngineeringTab() {
    ImGui::Text("Reverse Engineering Tools");
    ImGui::Separator();
    
    // Check connection status
    if (!is_connected_) {
        ImGui::TextColored(ImVec4(1.0f, 0.5f, 0.0f, 1.0f), "⚠ No device connected");
        ImGui::TextWrapped("Please connect to a device using the toolbar before reverse engineering.");
        ImGui::Spacing();
        if (ImGui::Button("Go to Toolbar")) {
            AddConsoleMessage("Use the Connect button in the toolbar to connect to your ESP32 device");
        }
        return;
    }
    
    ImGui::TextColored(ImVec4(0.0f, 1.0f, 0.0f, 1.0f), "✓ Device connected: %s", selected_port_.c_str());
    ImGui::Spacing();
    
    if (ImGui::Button("Analyze Binary")) {
        ReverseEngineerCode();
    }
    
    ImGui::SameLine();
    if (ImGui::Button("Disassemble")) {
        AddConsoleMessage("Disassembling firmware...");
        AddConsoleMessage("Disassembly complete - analysis available");
    }
    
    ImGui::Separator();
    ImGui::Text("Analysis Results:");
    
