kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
    ImGui::BeginChild("REResults", ImVec2(0, 0), true);
    ImGui::TextWrapped("ESP32 Firmware Analysis:");
    ImGui::BulletText("Architecture: Xtensa LX6");
    ImGui::BulletText("Flash size: 4MB");
    ImGui::BulletText("Entry point: 0x40080000");
    ImGui::BulletText("Functions detected: 42");
    ImGui::BulletText("Strings found: 127");
    ImGui::EndChild();
}

void ImGuiWindow::RenderPropertiesPanel() {
    ImGui::Text("Editor Properties");
    ImGui::Separator();
    
    ImGui::Text("File Info:");
    if (!editor_tabs_.empty() && active_editor_tab_ < editor_tabs_.size()) {
        const auto& tab = editor_tabs_[active_editor_tab_];
        ImGui::BulletText("Name: %s", tab.filename.c_str());
        ImGui::BulletText("Size: %zu bytes", tab.content.size());
        
        // Calculate line count only when content changes
        if (line_count_dirty_) {
            cached_line_count_ = static_cast<int>(std::count(tab.content.begin(), tab.content.end(), '\n') + 1);
            line_count_dirty_ = false;
        }
        ImGui::BulletText("Lines: %d", cached_line_count_);
        ImGui::BulletText("Modified: %s", tab.is_modified ? "Yes" : "No");
    } else {
        ImGui::TextDisabled("No file loaded");
    }
    
    ImGui::Separator();
    ImGui::Text("Editor Settings:");
    
    static bool show_line_numbers = true;
    static bool auto_indent = true;
    static bool syntax_highlight = true;
    
    ImGui::Checkbox("Show line numbers", &show_line_numbers);
    ImGui::Checkbox("Auto indent", &auto_indent);
    ImGui::Checkbox("Syntax highlighting", &syntax_highlight);
    
    ImGui::Separator();
    ImGui::Text("Board Config:");
    
    static int board_type = 0;
    const char* board_types[] = { "ESP32", "ESP32-S2", "ESP32-S3", "ESP32-C3" };
    ImGui::Combo("Board", &board_type, board_types, IM_ARRAYSIZE(board_types));
    
    static int freq = 240;
    ImGui::SliderInt("CPU Freq (MHz)", &freq, 80, 240);
    
    if (ImGui::Button("Apply Settings")) {
        AddConsoleMessage("Settings applied");
    }
}

void ImGuiWindow::RenderConsole() {
    ImGui::Text("Console Output");
    ImGui::Separator();
    
    ImGui::BeginChild("ConsoleScrolling", ImVec2(0, -30), false, ImGuiWindowFlags_HorizontalScrollbar);
    
    for (const auto& message : console_messages_) {
        ImGui::TextWrapped("%s", message.c_str());
    }
    
    if (scroll_to_bottom_) {
        ImGui::SetScrollHereY(1.0f);
        scroll_to_bottom_ = false;
    }
    
    ImGui::EndChild();
    
    ImGui::Separator();
    if (ImGui::Button("Clear Console")) {
        console_messages_.clear();
    }
}

void ImGuiWindow::RefreshFileList() {
    file_list_.clear();
    
    if (file_manager_) {
        file_list_ = file_manager_->GetFileList();
    }
    
    // Initialize file tree structure if empty
    if (root_folder_.children.empty()) {
        // Create a sample project structure
        FileNode main_folder;
        main_folder.name = "src";
        main_folder.path = "/src";
        main_folder.is_folder = true;
        
        FileNode sketch_file;
        sketch_file.name = "sketch.ino";
        sketch_file.path = "/src/sketch.ino";
        sketch_file.is_folder = false;
        main_folder.children.push_back(sketch_file);
        
        FileNode config_file;
        config_file.name = "config.h";
        config_file.path = "/src/config.h";
        config_file.is_folder = false;
        main_folder.children.push_back(config_file);
        
        root_folder_.children.push_back(main_folder);
        
        // Add some files in root
        FileNode readme;
        readme.name = "README.md";
        readme.path = "/README.md";
        readme.is_folder = false;
        root_folder_.children.push_back(readme);
    }
    
    // Add files from file_list_ to the tree if they're not already there
    for (const auto& filename : file_list_) {
        bool found = false;
        for (const auto& child : root_folder_.children) {
            if (!child.is_folder && child.name == filename) {
                found = true;
                break;
            }
        }
        
        if (!found) {
            FileNode file_node;
            file_node.name = filename;
            file_node.path = "/" + filename;
            file_node.is_folder = false;
            root_folder_.children.push_back(file_node);
        }
    }
}

void ImGuiWindow::RefreshPortList() {
    available_ports_.clear();
    
    if (serial_monitor_) {
        available_ports_ = serial_monitor_->GetAvailablePorts();
    }
    
    // Add some default ports if empty
    if (available_ports_.empty()) {
        available_ports_.push_back("/dev/ttyUSB0");
        available_ports_.push_back("/dev/ttyUSB1");
        available_ports_.push_back("COM3");
        available_ports_.push_back("COM4");
    }
    
    if (!available_ports_.empty() && selected_port_.empty()) {
        selected_port_index_ = 0;
        selected_port_ = available_ports_[0];
    }
}

void ImGuiWindow::LoadFile(const std::string& filename) {
    // Check if file is already open in a tab
    for (size_t i = 0; i < editor_tabs_.size(); i++) {
        if (editor_tabs_[i].filename == filename) {
            active_editor_tab_ = i;
            AddConsoleMessage("Switched to file: " + filename);
            return;
        }
    }
    
    // Create new tab
    EditorTab new_tab;
    new_tab.filename = filename;
    
    if (file_manager_ && file_manager_->FileExists(filename)) {
        new_tab.content = file_manager_->GetFileContent(filename);
    } else {
        new_tab.content = "// File: " + filename + "\n\n" + std::string(SIMPLE_SKETCH_TEMPLATE);
    }
    
    new_tab.is_modified = false;
    std::snprintf(new_tab.buffer, EDITOR_BUFFER_SIZE, "%s", new_tab.content.c_str());
    editor_tabs_.push_back(new_tab);
    active_editor_tab_ = editor_tabs_.size() - 1;
    
    line_count_dirty_ = true;
    
    if (text_editor_) {
        text_editor_->SetText(new_tab.content);
    }
    
