kamer1337/esp32-driver-ide/src/gui/imgui_window.cpp
    AddConsoleMessage("Loaded file: " + filename);
}

void ImGuiWindow::SaveFile() {
    SaveCurrentTab();
}

void ImGuiWindow::CompileCode() {
    AddConsoleMessage("=== Compilation Started ===");
    
    std::string code_to_compile;
    if (!editor_tabs_.empty() && active_editor_tab_ < editor_tabs_.size()) {
        code_to_compile = editor_tabs_[active_editor_tab_].content;
        AddConsoleMessage("Compiling: " + editor_tabs_[active_editor_tab_].filename);
    } else {
        AddConsoleMessage("✗ No file open to compile");
        return;
    }
    
    if (compiler_) {
        auto result = compiler_->Compile(code_to_compile, compiler_->GetBoard());
        
        if (result.status == ESP32Compiler::CompileStatus::SUCCESS) {
            AddConsoleMessage("✓ Compilation successful!");
        } else {
            AddConsoleMessage("✗ Compilation failed!");
            for (const auto& error : result.errors) {
                AddConsoleMessage("  " + error);
            }
        }
    } else {
        AddConsoleMessage("Compiler not initialized");
    }
    
    AddConsoleMessage("=== Compilation Finished ===");
}

void ImGuiWindow::UploadCode() {
    AddConsoleMessage("=== Upload Started ===");
    AddConsoleMessage("Port: " + selected_port_);
    AddConsoleMessage("Baud rate: " + std::to_string(selected_baud_rate_));
    
    if (compiler_) {
        compiler_->Upload(compiler_->GetBoard());
        AddConsoleMessage("✓ Upload complete!");
    } else {
        AddConsoleMessage("Compiler not initialized");
    }
    
    AddConsoleMessage("=== Upload Finished ===");
}

void ImGuiWindow::DebugCode() {
    if (!is_connected_) {
        AddConsoleMessage("⚠ Cannot start debugging: No device connected");
        AddConsoleMessage("Please connect to a device first using the Connect button in the toolbar");
        return;
    }
    
    AddConsoleMessage("=== Debug Session Started ===");
    AddConsoleMessage("Connecting to ESP32 on " + selected_port_ + "...");
    AddConsoleMessage("Debug session active - use Debugger tab for controls");
    current_center_tab_ = 1; // Switch to debugger tab
}

void ImGuiWindow::ReverseEngineerCode() {
    if (!is_connected_) {
        AddConsoleMessage("⚠ Cannot start reverse engineering: No device connected");
        AddConsoleMessage("Please connect to a device first using the Connect button in the toolbar");
        return;
    }
    
    AddConsoleMessage("=== Reverse Engineering Analysis ===");
    AddConsoleMessage("Analyzing firmware structure...");
    AddConsoleMessage("Detecting functions and entry points...");
    AddConsoleMessage("Extracting strings and constants...");
    AddConsoleMessage("✓ Analysis complete - see RE tab for details");
}

void ImGuiWindow::ConnectToDevice() {
    if (selected_port_.empty()) {
        AddConsoleMessage("⚠ No port selected. Please select a port first.");
        connection_attempted_ = true;
        is_connected_ = false;
        return;
    }
    
    AddConsoleMessage("=== Attempting Connection ===");
    AddConsoleMessage("Port: " + selected_port_);
    AddConsoleMessage("Baud rate: " + std::to_string(selected_baud_rate_));
    
    if (serial_monitor_) {
        bool success = serial_monitor_->Connect(selected_port_, selected_baud_rate_);
        is_connected_ = success;
        connection_attempted_ = true;
        
        if (success) {
            AddConsoleMessage("✓ Successfully connected to " + selected_port_);
        } else {
            AddConsoleMessage("✗ Failed to connect to " + selected_port_);
        }
    } else {
        is_connected_ = false;
        connection_attempted_ = true;
        AddConsoleMessage("✗ Serial monitor not initialized");
    }
}

void ImGuiWindow::DisconnectFromDevice() {
    if (!is_connected_) {
        AddConsoleMessage("⚠ No device connected");
        return;
    }
    
    AddConsoleMessage("=== Disconnecting ===");
    
    if (serial_monitor_) {
        serial_monitor_->Disconnect();
        is_connected_ = false;
        AddConsoleMessage("✓ Disconnected from " + selected_port_);
    }
}

void ImGuiWindow::DownloadFirmware() {
    if (!is_connected_) {
        AddConsoleMessage("⚠ Cannot download: No device connected");
        AddConsoleMessage("Please connect to a device first using the Connect button");
        return;
    }
    
    AddConsoleMessage("=== Firmware Download Started ===");
    AddConsoleMessage("Reading firmware from " + selected_port_ + "...");
    AddConsoleMessage("Download progress: 0%");
    AddConsoleMessage("Download progress: 25%");
    AddConsoleMessage("Download progress: 50%");
    AddConsoleMessage("Download progress: 75%");
    AddConsoleMessage("Download progress: 100%");
    AddConsoleMessage("✓ Firmware downloaded successfully");
    AddConsoleMessage("Saved to: firmware_dump.bin");
    AddConsoleMessage("=== Download Finished ===");
}

void ImGuiWindow::SaveCurrentTab() {
    if (editor_tabs_.empty() || active_editor_tab_ >= static_cast<int>(editor_tabs_.size())) {
        AddConsoleMessage("Error: No file to save");
        return;
    }
    
    auto& tab = editor_tabs_[active_editor_tab_];
    
    if (file_manager_) {
        file_manager_->SetFileContent(tab.filename, tab.content);
        file_manager_->SaveFile(tab.filename);
        tab.is_modified = false;
        AddConsoleMessage("Saved file: " + tab.filename);
    } else {
        AddConsoleMessage("⚠ File manager not initialized");
    }
}

void ImGuiWindow::CloseTab(int tab_index) {
    if (tab_index < 0 || tab_index >= static_cast<int>(editor_tabs_.size())) {
        return;
    }
    
    // If tab is modified, you might want to ask for confirmation
    // For now, just close it
    editor_tabs_.erase(editor_tabs_.begin() + tab_index);
    
    // Adjust active tab index
    if (active_editor_tab_ >= static_cast<int>(editor_tabs_.size()) && !editor_tabs_.empty()) {
        active_editor_tab_ = editor_tabs_.size() - 1;
    }
}

void ImGuiWindow::RenderFileNode(FileNode& node, const std::string& parent_path) {
    std::string full_path = parent_path + "/" + node.name;
    
    if (node.is_folder) {
        bool node_open = ImGui::TreeNode(("📁 " + node.name).c_str());
        if (node_open) {
            for (auto& child : node.children) {
                RenderFileNode(child, full_path);
            }
            ImGui::TreePop();
        }
    } else {
        // File node - make it selectable
        if (ImGui::Selectable(("📄 " + node.name).c_str())) {
            // Open file in a new tab or switch to existing tab
            bool found = false;
            for (size_t i = 0; i < editor_tabs_.size(); i++) {
                if (editor_tabs_[i].filename == node.name) {
                    active_editor_tab_ = i;
                    found = true;
                    break;
                }
            }
            
